group-reports/sharif/results/10G-disk-throughput-tuning-protocol-B-sndbuf-2m/test-1.txt
read-sequentially-test-job: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
read-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

read-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=51600: Fri Jul 14 19:13:58 2023
   read: IOPS=189, BW=760MiB/s (797MB/s)(445GiB/600044msec)
    slat (usec): min=32, max=316864, avg=3561.66, stdev=3466.31
    clat (msec): min=11, max=553, avg=80.66, stdev= 9.68
     lat (msec): min=12, max=558, avg=84.23, stdev= 9.70
    clat percentiles (msec):
     |  1.00th=[   70],  5.00th=[   73], 10.00th=[   75], 20.00th=[   78],
     | 30.00th=[   78], 40.00th=[   80], 50.00th=[   81], 60.00th=[   82],
     | 70.00th=[   83], 80.00th=[   84], 90.00th=[   87], 95.00th=[   89],
     | 99.00th=[  100], 99.50th=[  118], 99.90th=[  140], 99.95th=[  313],
     | 99.99th=[  393]
   bw (  KiB/s): min=303104, max=868352, per=99.98%, avg=777906.14, stdev=42798.95, samples=1200
   iops        : min=   74, max=  212, avg=189.87, stdev=10.45, samples=1200
  lat (msec)   : 20=0.01%, 50=0.48%, 100=98.62%, 250=0.84%, 500=0.06%
  lat (msec)   : 750=0.01%
  cpu          : usr=0.16%, sys=1.98%, ctx=123168, majf=0, minf=554
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=113983,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=760MiB/s (797MB/s), 760MiB/s-760MiB/s (797MB/s-797MB/s), io=445GiB (478GB), run=600044-600044msec

Disk stats (read/write):
    drbd1: ios=911908/12, merge=0/0, ticks=55511413/406, in_queue=55511819, util=100.00%, aggrios=911908/12, aggrmerge=0/0, aggrticks=55510004/406, aggrin_queue=55510410, aggrutil=100.00%
    dm-0: ios=911908/12, merge=0/0, ticks=55510004/406, in_queue=55510410, util=100.00%, aggrios=911864/9, aggrmerge=44/3, aggrticks=55112410/275, aggrin_queue=54657835, aggrutil=100.00%
  sde: ios=911864/9, merge=44/3, ticks=55112410/275, in_queue=54657835, util=100.00%