group-reports/sharif/results/10G-disk-throughput-tuning-protocol-B-sndbuf-2m/test-3.txt
read-randomly-test-job: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
read-randomly-test-job: Laying out IO file (1 file / 10240MiB)

read-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=54384: Fri Jul 14 19:34:33 2023
   read: IOPS=68.2k, BW=533MiB/s (559MB/s)(312GiB/600003msec)
    slat (usec): min=2, max=335817, avg=221.15, stdev=831.55
    clat (usec): min=31, max=1000.3k, avg=3528.61, stdev=3581.08
     lat (usec): min=214, max=1000.3k, avg=3749.98, stdev=3742.01
    clat percentiles (usec):
     |  1.00th=[  734],  5.00th=[ 1369], 10.00th=[ 1762], 20.00th=[ 2245],
     | 30.00th=[ 2638], 40.00th=[ 2966], 50.00th=[ 3294], 60.00th=[ 3654],
     | 70.00th=[ 4047], 80.00th=[ 4555], 90.00th=[ 5407], 95.00th=[ 6259],
     | 99.00th=[ 8586], 99.50th=[ 9896], 99.90th=[13829], 99.95th=[16057],
     | 99.99th=[68682]
   bw (  KiB/s): min=   80, max=41552, per=6.25%, avg=34120.37, stdev=3879.83, samples=19196
   iops        : min=   10, max= 5194, avg=4265.02, stdev=484.98, samples=19196
  lat (usec)   : 50=0.01%, 250=0.01%, 500=0.34%, 750=0.74%, 1000=1.25%
  lat (msec)   : 2=12.10%, 4=54.38%, 10=30.73%, 20=0.45%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=1.29%, sys=5.41%, ctx=23371318, majf=0, minf=661
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=40950437,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=533MiB/s (559MB/s), 533MiB/s-533MiB/s (559MB/s-559MB/s), io=312GiB (335GB), run=600003-600003msec

Disk stats (read/write):
    drbd1: ios=40945618/12, merge=0/0, ticks=65200180/51, in_queue=65200231, util=100.00%, aggrios=40950441/12, aggrmerge=0/0, aggrticks=65149101/51, aggrin_queue=65149152, aggrutil=100.00%
    dm-0: ios=40950441/12, merge=0/0, ticks=65149101/51, in_queue=65149152, util=100.00%, aggrios=40950322/9, aggrmerge=119/3, aggrticks=56395777/32, aggrin_queue=34226608, aggrutil=100.00%
  sde: ios=40950322/9, merge=119/3, ticks=56395777/32, in_queue=34226608, util=100.00%